In [37]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [38]:
ruta = '../data/actor.csv' #Importo el archivo csv
df = pd.read_csv(ruta)
df.head()

  actor_id;first_name;last_name;last_update
0        1;PENELOPE;GUINESS;15/02/2006 4:34
1           2;NICK;WAHLBERG;15/02/2006 4:34
2                3;ED;CHASE;15/02/2006 4:34
3          4;JENNIFER;DAVIS;15/02/2006 4:34
4     5;JOHNNY;LOLLOBRIGIDA;15/02/2006 4:34

In [39]:
df.columns # nombre de las columnas en este caso es 
           # una solta str

Index(['actor_id;first_name;last_name;last_update'], dtype='object')

In [40]:
df.columns = [c.upper().replace('_', ' ') for c in df.columns]

df.columns #Sustituimos el _  por ("espacio")

Index(['ACTOR ID;FIRST NAME;LAST NAME;LAST UPDATE'], dtype='object')

In [41]:
df.head() # vemos la cabecera de las 5 primeras filas

  ACTOR ID;FIRST NAME;LAST NAME;LAST UPDATE
0        1;PENELOPE;GUINESS;15/02/2006 4:34
1           2;NICK;WAHLBERG;15/02/2006 4:34
2                3;ED;CHASE;15/02/2006 4:34
3          4;JENNIFER;DAVIS;15/02/2006 4:34
4     5;JOHNNY;LOLLOBRIGIDA;15/02/2006 4:34

In [42]:
df.shape # me da información existe 200 filas y solo una columna
         # por lo que se decide usar el método split para separas las columnas

(200, 1)

In [54]:
df["ACTOR ID;FIRST NAME;LAST NAME;LAST UPDATE"].str.split(';', expand=True)

# Split separa por defecto por el " ", por lo que pongo ; para separar las columnas por ese caráctersx

       0         1             2                3
0      1  PENELOPE       GUINESS  15/02/2006 4:34
1      2      NICK      WAHLBERG  15/02/2006 4:34
2      3        ED         CHASE  15/02/2006 4:34
3      4  JENNIFER         DAVIS  15/02/2006 4:34
4      5    JOHNNY  LOLLOBRIGIDA  15/02/2006 4:34
..   ...       ...           ...              ...
195  196      BELA        WALKEN  15/02/2006 4:34
196  197     REESE          WEST  15/02/2006 4:34
197  198      MARY        KEITEL  15/02/2006 4:34
198  199     JULIA       FAWCETT  15/02/2006 4:34
199  200     THORA        TEMPLE  15/02/2006 4:34

[200 rows x 4 columns]